TexasInstruments/mcal_am263x/mcal/FsiRx/V0/Cdd_FsiRx_Reg.h
/*
 *  Copyright (C) 2023 Texas Instruments Incorporated.
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions
 *  are met:
 *
 *    Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the
 *    distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 *  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 *  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 *  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 *  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 *  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 *  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#ifndef CDD_FSI_RX_REG_H_
#define CDD_FSI_RX_REG_H_

#ifdef _cplusplus
extern "C" {
#endif

#include "Std_Types.h"
/**************************************************************************
 * Module Base Offset Values
 **************************************************************************/

#define CSL_CDD_FSI_RX_CFG_REGS_BASE (0x00000000U)

/**************************************************************************
 * Hardware Region  : CDD FSI RX Registers
 **************************************************************************/

/**************************************************************************
 * Register Overlay Structure
 **************************************************************************/

typedef struct
{
    volatile uint16 RX_MASTER_CTRL_ALTB;
    volatile uint16 RESERVED_1;
    volatile uint16 RESERVED_2;
    volatile uint16 RESERVED_3;
    volatile uint16 RX_OPER_CTRL;
    volatile uint16 RESERVED_4;
    volatile uint16 RX_FRAME_INFO;
    volatile uint16 RX_FRAME_TAG_UDATA;
    volatile uint16 RX_DMA_CTRL;
    volatile uint16 RESERVED_5;
    volatile uint16 RX_EVT_STS_ALT1;
    volatile uint16 RX_CRC_INFO;
    volatile uint16 RX_EVT_CLR_ALT1;
    volatile uint16 RX_EVT_FRC_ALT1;
    volatile uint16 RX_BUF_PTR_LOAD;
    volatile uint16 RX_BUF_PTR_STS;
    volatile uint16 RX_FRAME_WD_CTRL;
    volatile uint16 RESERVED_6;
    volatile uint32 RX_FRAME_WD_REF;
    volatile uint32 RX_FRAME_WD_CNT;
    volatile uint16 RX_PING_WD_CTRL;
    volatile uint16 RX_PING_TAG;
    volatile uint32 RX_PING_WD_REF;
    volatile uint32 RX_PING_WD_CNT;
    volatile uint16 RX_INT1_CTRL_ALT1;
    volatile uint16 RX_INT2_CTRL_ALT1;
    volatile uint16 RX_LOCK_CTRL;
    volatile uint16 RESERVED_7;
    volatile uint32 RX_ECC_DATA;
    volatile uint16 RX_ECC_VAL;
    volatile uint16 RESERVED_8;
    volatile uint32 RX_ECC_SEC_DATA;
    volatile uint16 RX_ECC_LOG;
    volatile uint16 RESERVED_9;
    volatile uint16 RX_FRAME_TAG_CMP;
    volatile uint16 RX_PING_TAG_CMP;
    volatile uint16 RESERVED_10[2];
    volatile uint32 RX_TRIG_CTRL_0;
    volatile uint32 RX_TRIG_WIDTH_0;
    volatile uint16 RX_DLYLINE_CTRL;
    volatile uint16 RESERVED_11[1];
    volatile uint32 RX_TRIG_CTRL_1;
    volatile uint32 RX_TRIG_CTRL_2;
    volatile uint32 RX_TRIG_CTRL_3;
    volatile uint32 RX_VIS_1;
    volatile uint16 RX_UDATA_FILTER;
    volatile uint16 RESERVED_12[5];
    volatile uint16 RX_BUF_BASE[16];
} CSL_cdd_fsi_rx_cfgRegs;

/**************************************************************************
 * Register Macros
 **************************************************************************/

#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB      (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RESERVED_1               (0x00000002U)
#define CSL_CDD_FSI_RX_CFG_RESERVED_2               (0x00000004U)
#define CSL_CDD_FSI_RX_CFG_RESERVED_3               (0x00000006U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL             (0x00000008U)
#define CSL_CDD_FSI_RX_CFG_RESERVED_4               (0x0000000AU)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_INFO            (0x0000000CU)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA       (0x0000000EU)
#define CSL_CDD_FSI_RX_CFG_RX_DMA_CTRL              (0x00000010U)
#define CSL_CDD_FSI_RX_CFG_RESERVED_5               (0x00000012U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1          (0x00000014U)
#define CSL_CDD_FSI_RX_CFG_RX_CRC_INFO              (0x00000016U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1          (0x00000018U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1          (0x0000001AU)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_LOAD          (0x0000001CU)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS           (0x0000001EU)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CTRL         (0x00000020U)
#define CSL_CDD_FSI_RX_CFG_RESERVED_6               (0x00000022U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_REF          (0x00000024U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CNT          (0x00000028U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CTRL          (0x0000002CU)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG              (0x0000002EU)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_REF           (0x00000030U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CNT           (0x00000034U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1        (0x00000038U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1        (0x0000003AU)
#define CSL_CDD_FSI_RX_CFG_RX_LOCK_CTRL             (0x0000003CU)
#define CSL_CDD_FSI_RX_CFG_RESERVED_7               (0x0000003EU)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_DATA              (0x00000040U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_VAL               (0x00000044U)
#define CSL_CDD_FSI_RX_CFG_RESERVED_8               (0x00000046U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_SEC_DATA          (0x00000048U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_LOG               (0x0000004CU)
#define CSL_CDD_FSI_RX_CFG_RESERVED_9               (0x0000004EU)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP         (0x00000050U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP          (0x00000052U)
#define CSL_CDD_FSI_RX_CFG_RESERVED_10(RESERVED_10) (0x00000054U + ((RESERVED_10) * 0x2U))
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL_0           (0x00000058U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_WIDTH_0          (0x0000005CU)
#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL          (0x00000060U)
#define CSL_CDD_FSI_RX_CFG_RESERVED_11(RESERVED_11) (0x00000062U + ((RESERVED_11) * 0x2U))
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL_1           (0x00000064U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL_2           (0x00000068U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL_3           (0x0000006CU)
#define CSL_CDD_FSI_RX_CFG_RX_VIS_1                 (0x00000070U)
#define CSL_CDD_FSI_RX_CFG_RX_UDATA_FILTER          (0x00000074U)
#define CSL_CDD_FSI_RX_CFG_RESERVED_12(RESERVED_12) (0x00000076U + ((RESERVED_12) * 0x2U))
#define CSL_CDD_FSI_RX_CFG_RX_BUF_BASE(RX_BUF_BASE) (0x00000080U + ((RX_BUF_BASE) * 0x2U))

/**************************************************************************
 * Field Definition Macros
 **************************************************************************/

