TexasInstruments/mcal_am263x/mcal/FsiRx/V0/Cdd_FsiRx_Reg.h
/* CDD_FSI_RX_MASTER_CTRL_ALTB_ */

#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_CORE_RST_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_CORE_RST_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_CORE_RST_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_INT_LOOPBACK_MASK  (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_INT_LOOPBACK_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_INT_LOOPBACK_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_SPI_PAIRING_MASK  (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_SPI_PAIRING_SHIFT (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_SPI_PAIRING_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_INPUT_ISOLATE_MASK  (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_INPUT_ISOLATE_SHIFT (0x0003U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_INPUT_ISOLATE_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_DATA_FILTER_EN_MASK  (0x0010U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_DATA_FILTER_EN_SHIFT (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_DATA_FILTER_EN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_RESERVED_1_MASK  (0x00E0U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_RESERVED_1_SHIFT (0x0005U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_RESERVED_1_MAX   (0x0007U)

#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_KEY_MASK  (0xFF00U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_KEY_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_MASTER_CTRL_ALTB_KEY_MAX   (0x00FFU)

/* RESERVED_1 */

/* RESERVED_2 */

/* RESERVED_3 */

/* CDD_FSI_RX_OPER_CTRL */

#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_DATA_WIDTH_MASK  (0x0003U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_DATA_WIDTH_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_DATA_WIDTH_MAX   (0x0003U)

#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_SPI_MODE_MASK  (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_SPI_MODE_SHIFT (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_SPI_MODE_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_N_WORDS_MASK  (0x0078U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_N_WORDS_SHIFT (0x0003U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_N_WORDS_MAX   (0x000FU)

#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_ECC_SEL_MASK  (0x0080U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_ECC_SEL_SHIFT (0x0007U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_ECC_SEL_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_PING_WD_RST_MODE_MASK  (0x0100U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_PING_WD_RST_MODE_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_PING_WD_RST_MODE_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_RESERVED_1_MASK  (0xFE00U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_RESERVED_1_SHIFT (0x0009U)
#define CSL_CDD_FSI_RX_CFG_RX_OPER_CTRL_RESERVED_1_MAX   (0x007FU)

/* RESERVED_4 */

/* CDD_FSI_RX_FRAME_INFO */

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_INFO_FRAME_TYPE_MASK  (0x000FU)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_INFO_FRAME_TYPE_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_INFO_FRAME_TYPE_MAX   (0x000FU)

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_INFO_RESERVED_1_MASK  (0xFFF0U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_INFO_RESERVED_1_SHIFT (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_INFO_RESERVED_1_MAX   (0x0FFFU)

/* CDD_FSI_RX_FRAME_TAG_UDATA */

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA_ZERO_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA_ZERO_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA_ZERO_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA_FRAME_TAG_MASK  (0x001EU)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA_FRAME_TAG_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA_FRAME_TAG_MAX   (0x000FU)

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA_RESERVED_1_MASK  (0x00E0U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA_RESERVED_1_SHIFT (0x0005U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA_RESERVED_1_MAX   (0x0007U)

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA_USER_DATA_MASK  (0xFF00U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA_USER_DATA_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_UDATA_USER_DATA_MAX   (0x00FFU)

/* CDD_FSI_RX_DMA_CTRL */

#define CSL_CDD_FSI_RX_CFG_RX_DMA_CTRL_DMA_EVT_EN_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_DMA_CTRL_DMA_EVT_EN_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_DMA_CTRL_DMA_EVT_EN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_DMA_CTRL_RESERVED_1_MASK  (0xFFFEU)
#define CSL_CDD_FSI_RX_CFG_RX_DMA_CTRL_RESERVED_1_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_DMA_CTRL_RESERVED_1_MAX   (0x7FFFU)

/* RESERVED_5 */

/* CDD_FSI_RX_EVT_STS_ALT1_ */

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_PING_WD_TO_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_PING_WD_TO_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_PING_WD_TO_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_FRAME_WD_TO_MASK  (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_FRAME_WD_TO_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_FRAME_WD_TO_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_CRC_ERR_MASK  (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_CRC_ERR_SHIFT (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_CRC_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_TYPE_ERR_MASK  (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_TYPE_ERR_SHIFT (0x0003U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_TYPE_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_EOF_ERR_MASK  (0x0010U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_EOF_ERR_SHIFT (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_EOF_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_BUF_OVERRUN_MASK  (0x0020U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_BUF_OVERRUN_SHIFT (0x0005U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_BUF_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_FRAME_DONE_MASK  (0x0040U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_FRAME_DONE_SHIFT (0x0006U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_FRAME_DONE_MAX   (0x0001U)

