TexasInstruments/mcal_am263x/mcal/FsiRx/V0/Cdd_FsiRx_Reg.h
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_BUF_UNDERRUN_MASK  (0x0080U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_BUF_UNDERRUN_SHIFT (0x0007U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_BUF_UNDERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_ERR_FRAME_MASK  (0x0100U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_ERR_FRAME_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_ERR_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_PING_FRAME_MASK  (0x0200U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_PING_FRAME_SHIFT (0x0009U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_PING_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_FRAME_OVERRUN_MASK  (0x0400U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_FRAME_OVERRUN_SHIFT (0x000AU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_FRAME_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_DATA_FRAME_MASK  (0x0800U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_DATA_FRAME_SHIFT (0x000BU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_DATA_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_PING_TAG_MATCH_MASK  (0x1000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_PING_TAG_MATCH_SHIFT (0x000CU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_PING_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_DATA_TAG_MATCH_MASK  (0x2000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_DATA_TAG_MATCH_SHIFT (0x000DU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_DATA_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_ERROR_TAG_MATCH_MASK  (0x4000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_ERROR_TAG_MATCH_SHIFT (0x000EU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_ERROR_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_RESERVED_1_MASK  (0x8000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_RESERVED_1_SHIFT (0x000FU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_STS_ALT1_RESERVED_1_MAX   (0x0001U)

/* CDD_FSI_RX_CRC_INFO */

#define CSL_CDD_FSI_RX_CFG_RX_CRC_INFO_RX_CRC_MASK  (0x00FFU)
#define CSL_CDD_FSI_RX_CFG_RX_CRC_INFO_RX_CRC_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_CRC_INFO_RX_CRC_MAX   (0x00FFU)

#define CSL_CDD_FSI_RX_CFG_RX_CRC_INFO_CALC_CRC_MASK  (0xFF00U)
#define CSL_CDD_FSI_RX_CFG_RX_CRC_INFO_CALC_CRC_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_CRC_INFO_CALC_CRC_MAX   (0x00FFU)

/* CDD_FSI_RX_EVT_CLR_ALT1 */

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_PING_WD_TO_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_PING_WD_TO_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_PING_WD_TO_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_FRAME_WD_TO_MASK  (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_FRAME_WD_TO_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_FRAME_WD_TO_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_CRC_ERR_MASK  (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_CRC_ERR_SHIFT (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_CRC_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_TYPE_ERR_MASK  (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_TYPE_ERR_SHIFT (0x0003U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_TYPE_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_EOF_ERR_MASK  (0x0010U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_EOF_ERR_SHIFT (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_EOF_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_BUF_OVERRUN_MASK  (0x0020U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_BUF_OVERRUN_SHIFT (0x0005U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_BUF_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_FRAME_DONE_MASK  (0x0040U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_FRAME_DONE_SHIFT (0x0006U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_FRAME_DONE_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_BUF_UNDERRUN_MASK  (0x0080U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_BUF_UNDERRUN_SHIFT (0x0007U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_BUF_UNDERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_ERR_FRAME_MASK  (0x0100U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_ERR_FRAME_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_ERR_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_PING_FRAME_MASK  (0x0200U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_PING_FRAME_SHIFT (0x0009U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_PING_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_FRAME_OVERRUN_MASK  (0x0400U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_FRAME_OVERRUN_SHIFT (0x000AU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_FRAME_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_DATA_FRAME_MASK  (0x0800U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_DATA_FRAME_SHIFT (0x000BU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_DATA_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_PING_TAG_MATCH_MASK  (0x1000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_PING_TAG_MATCH_SHIFT (0x000CU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_PING_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_DATA_TAG_MATCH_MASK  (0x2000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_DATA_TAG_MATCH_SHIFT (0x000DU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_DATA_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_ERROR_TAG_MATCH_MASK  (0x4000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_ERROR_TAG_MATCH_SHIFT (0x000EU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_ERROR_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_RESERVED_1_MASK  (0x8000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_RESERVED_1_SHIFT (0x000FU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_CLR_ALT1_RESERVED_1_MAX   (0x0001U)

/* CDD_FSI_RX_EVT_FRC_ALT1 */

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_PING_WD_TO_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_PING_WD_TO_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_PING_WD_TO_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_FRAME_WD_TO_MASK  (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_FRAME_WD_TO_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_FRAME_WD_TO_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_CRC_ERR_MASK  (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_CRC_ERR_SHIFT (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_CRC_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_TYPE_ERR_MASK  (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_TYPE_ERR_SHIFT (0x0003U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_TYPE_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_EOF_ERR_MASK  (0x0010U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_EOF_ERR_SHIFT (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_EOF_ERR_MAX   (0x0001U)

