TexasInstruments/mcal_am263x/mcal/FsiRx/V0/Cdd_FsiRx_Reg.h
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_BUF_OVERRUN_MASK  (0x0020U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_BUF_OVERRUN_SHIFT (0x0005U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_BUF_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_FRAME_DONE_MASK  (0x0040U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_FRAME_DONE_SHIFT (0x0006U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_FRAME_DONE_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_BUF_UNDERRUN_MASK  (0x0080U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_BUF_UNDERRUN_SHIFT (0x0007U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_BUF_UNDERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_ERR_FRAME_MASK  (0x0100U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_ERR_FRAME_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_ERR_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_PING_FRAME_MASK  (0x0200U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_PING_FRAME_SHIFT (0x0009U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_PING_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_FRAME_OVERRUN_MASK  (0x0400U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_FRAME_OVERRUN_SHIFT (0x000AU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_FRAME_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_DATA_FRAME_MASK  (0x0800U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_DATA_FRAME_SHIFT (0x000BU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_DATA_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_PING_TAG_MATCH_MASK  (0x1000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_PING_TAG_MATCH_SHIFT (0x000CU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_PING_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_DATA_TAG_MATCH_MASK  (0x2000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_DATA_TAG_MATCH_SHIFT (0x000DU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_DATA_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_ERROR_TAG_MATCH_MASK  (0x4000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_ERROR_TAG_MATCH_SHIFT (0x000EU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_ERROR_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_RESERVED_1_MASK  (0x8000U)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_RESERVED_1_SHIFT (0x000FU)
#define CSL_CDD_FSI_RX_CFG_RX_EVT_FRC_ALT1_RESERVED_1_MAX   (0x0001U)

/* CDD_FSI_RX_BUF_PTR_LOAD */

#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_LOAD_BUF_PTR_LOAD_MASK  (0x000FU)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_LOAD_BUF_PTR_LOAD_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_LOAD_BUF_PTR_LOAD_MAX   (0x000FU)

#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_LOAD_RESERVED_1_MASK  (0xFFF0U)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_LOAD_RESERVED_1_SHIFT (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_LOAD_RESERVED_1_MAX   (0x0FFFU)

/* CDD_FSI_RX_BUF_PTR_STS */

#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS_CURR_BUF_PTR_MASK  (0x000FU)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS_CURR_BUF_PTR_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS_CURR_BUF_PTR_MAX   (0x000FU)

#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS_RESERVED_1_MASK  (0x00F0U)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS_RESERVED_1_SHIFT (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS_RESERVED_1_MAX   (0x000FU)

#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS_CURR_WORD_CNT_MASK  (0x1F00U)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS_CURR_WORD_CNT_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS_CURR_WORD_CNT_MAX   (0x001FU)

#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS_RESERVED_2_MASK  (0xE000U)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS_RESERVED_2_SHIFT (0x000DU)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_PTR_STS_RESERVED_2_MAX   (0x0007U)

/* CDD_FSI_RX_FRAME_WD_CTRL */

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CTRL_FRAME_WD_CNT_RST_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CTRL_FRAME_WD_CNT_RST_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CTRL_FRAME_WD_CNT_RST_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CTRL_FRAME_WD_EN_MASK  (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CTRL_FRAME_WD_EN_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CTRL_FRAME_WD_EN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CTRL_RESERVED_1_MASK  (0xFFFCU)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CTRL_RESERVED_1_SHIFT (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CTRL_RESERVED_1_MAX   (0x3FFFU)

/* RESERVED_6 */

/* CDD_FSI_RX_FRAME_WD_REF */

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_REF_FRAME_WD_REF_MASK  (0xFFFFFFFFU)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_REF_FRAME_WD_REF_SHIFT (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_REF_FRAME_WD_REF_MAX   (0xFFFFFFFFU)

/* CDD_FSI_RX_FRAME_WD_CNT */

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CNT_FRAME_WD_CNT_MASK  (0xFFFFFFFFU)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CNT_FRAME_WD_CNT_SHIFT (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_WD_CNT_FRAME_WD_CNT_MAX   (0xFFFFFFFFU)

/* CDD_FSI_RX_PING_WD_CTRL */

#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CTRL_PING_WD_RST_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CTRL_PING_WD_RST_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CTRL_PING_WD_RST_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CTRL_PING_WD_EN_MASK  (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CTRL_PING_WD_EN_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CTRL_PING_WD_EN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CTRL_RESERVED_1_MASK  (0xFFFCU)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CTRL_RESERVED_1_SHIFT (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CTRL_RESERVED_1_MAX   (0x3FFFU)

/* CDD_FSI_RX_PING_TAG */

#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_ZERO_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_ZERO_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_ZERO_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_PING_TAG_MASK  (0x000EU)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_PING_TAG_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_PING_TAG_MAX   (0x000FU)

#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_RESERVED_1_MASK  (0xFFE0U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_RESERVED_1_SHIFT (0x0005U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_RESERVED_1_MAX   (0x07FFU)

/* CDD_FSI_RX_PING_WD_REF */

