TexasInstruments/mcal_am263x/mcal/FsiRx/V0/Cdd_FsiRx_Reg.h
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_REF_PING_WD_REF_MASK  (0xFFFFFFFFU)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_REF_PING_WD_REF_SHIFT (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_REF_PING_WD_REF_MAX   (0xFFFFFFFFU)

/* CDD_FSI_RX_PING_WD_CNT */

#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CNT_PING_WD_CNT_MASK  (0xFFFFFFFFU)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CNT_PING_WD_CNT_SHIFT (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_WD_CNT_PING_WD_CNT_MAX   (0xFFFFFFFFU)

/* CDD_FSI_RX_INT1_CTRL_ALT1 */

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_PING_WD_TO_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_PING_WD_TO_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_PING_WD_TO_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_FRAME_WD_TO_MASK  (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_FRAME_WD_TO_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_FRAME_WD_TO_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_CRC_ERR_MASK  (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_CRC_ERR_SHIFT (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_CRC_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_TYPE_ERR_MASK  (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_TYPE_ERR_SHIFT (0x0003U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_TYPE_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_EOF_ERR_MASK  (0x0010U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_EOF_ERR_SHIFT (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_EOF_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_OVERRUN_MASK  (0x0020U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_OVERRUN_SHIFT (0x0005U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_FRAME_DONE_MASK  (0x0040U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_FRAME_DONE_SHIFT (0x0006U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_FRAME_DONE_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_UNDERRUN_MASK  (0x0080U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_UNDERRUN_SHIFT (0x0007U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_UNDERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_ERR_FRAME_MASK  (0x0100U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_ERR_FRAME_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_ERR_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_PING_FRAME_MASK  (0x0200U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_PING_FRAME_SHIFT (0x0009U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_PING_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_FRAME_OVERRUN_MASK  (0x0400U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_FRAME_OVERRUN_SHIFT (0x000AU)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_FRAME_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_DATA_FRAME_MASK  (0x0800U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_DATA_FRAME_SHIFT (0x000BU)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_DATA_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_PING_TAG_MATCH_MASK  (0x1000U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_PING_TAG_MATCH_SHIFT (0x000CU)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_PING_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_DATA_TAG_MATCH_MASK  (0x2000U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_DATA_TAG_MATCH_SHIFT (0x000DU)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_DATA_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_ERROR_TAG_MATCH_MASK  (0x4000U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_ERROR_TAG_MATCH_SHIFT (0x000EU)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_INT1_EN_ERROR_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_RESERVED_1_MASK  (0x8000U)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_RESERVED_1_SHIFT (0x000FU)
#define CSL_CDD_FSI_RX_CFG_RX_INT1_CTRL_ALT1_RESERVED_1_MAX   (0x0001U)

/* CDD_FSI_RX_INT2_CTRL_ALT1 */

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_PING_WD_TO_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_PING_WD_TO_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_PING_WD_TO_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_FRAME_WD_TO_MASK  (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_FRAME_WD_TO_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_FRAME_WD_TO_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_CRC_ERR_MASK  (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_CRC_ERR_SHIFT (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_CRC_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_TYPE_ERR_MASK  (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_TYPE_ERR_SHIFT (0x0003U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_TYPE_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_EOF_ERR_MASK  (0x0010U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_EOF_ERR_SHIFT (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_EOF_ERR_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_OVERRUN_MASK  (0x0020U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_OVERRUN_SHIFT (0x0005U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_FRAME_DONE_MASK  (0x0040U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_FRAME_DONE_SHIFT (0x0006U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_FRAME_DONE_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_UNDERRUN_MASK  (0x0080U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_UNDERRUN_SHIFT (0x0007U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_UNDERRUN_MAX   (0x0001U)

