TexasInstruments/mcal_am263x/mcal/FsiRx/V0/Cdd_FsiRx_Reg.h
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_ERR_FRAME_MASK  (0x0100U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_ERR_FRAME_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_ERR_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_PING_FRAME_MASK  (0x0200U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_PING_FRAME_SHIFT (0x0009U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_PING_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_FRAME_OVERRUN_MASK  (0x0400U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_FRAME_OVERRUN_SHIFT (0x000AU)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_FRAME_OVERRUN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_DATA_FRAME_MASK  (0x0800U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_DATA_FRAME_SHIFT (0x000BU)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_DATA_FRAME_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_PING_TAG_MATCH_MASK  (0x1000U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_PING_TAG_MATCH_SHIFT (0x000CU)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_PING_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_DATA_TAG_MATCH_MASK  (0x2000U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_DATA_TAG_MATCH_SHIFT (0x000DU)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_DATA_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_ERROR_TAG_MATCH_MASK  (0x4000U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_ERROR_TAG_MATCH_SHIFT (0x000EU)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_INT2_EN_ERROR_TAG_MATCH_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_RESERVED_1_MASK  (0x8000U)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_RESERVED_1_SHIFT (0x000FU)
#define CSL_CDD_FSI_RX_CFG_RX_INT2_CTRL_ALT1_RESERVED_1_MAX   (0x0001U)

/* CDD_FSI_RX_LOCK_CTRL */

#define CSL_CDD_FSI_RX_CFG_RX_LOCK_CTRL_LOCK_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_LOCK_CTRL_LOCK_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_LOCK_CTRL_LOCK_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_LOCK_CTRL_RESERVED_1_MASK  (0x00FEU)
#define CSL_CDD_FSI_RX_CFG_RX_LOCK_CTRL_RESERVED_1_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_LOCK_CTRL_RESERVED_1_MAX   (0x007FU)

#define CSL_CDD_FSI_RX_CFG_RX_LOCK_CTRL_KEY_MASK  (0xFF00U)
#define CSL_CDD_FSI_RX_CFG_RX_LOCK_CTRL_KEY_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_LOCK_CTRL_KEY_MAX   (0x00FFU)

/* RESERVED_7 */

/* CDD_FSI_RX_ECC_DATA */

#define CSL_CDD_FSI_RX_CFG_RX_ECC_DATA_DATA_LOW_MASK  (0x0000FFFFU)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_DATA_DATA_LOW_SHIFT (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_DATA_DATA_LOW_MAX   (0x0000FFFFU)

#define CSL_CDD_FSI_RX_CFG_RX_ECC_DATA_DATA_HIGH_MASK  (0xFFFF0000U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_DATA_DATA_HIGH_SHIFT (0x00000010U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_DATA_DATA_HIGH_MAX   (0x0000FFFFU)

/* CDD_FSI_RX_ECC_VAL */

#define CSL_CDD_FSI_RX_CFG_RX_ECC_VAL_ECC_VAL_MASK  (0x007FU)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_VAL_ECC_VAL_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_VAL_ECC_VAL_MAX   (0x007FU)

#define CSL_CDD_FSI_RX_CFG_RX_ECC_VAL_RESERVED_1_MASK  (0xFF80U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_VAL_RESERVED_1_SHIFT (0x0007U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_VAL_RESERVED_1_MAX   (0x01FFU)

/* RESERVED_8 */

/* CDD_FSI_RX_ECC_SEC_DATA */

#define CSL_CDD_FSI_RX_CFG_RX_ECC_SEC_DATA_SEC_DATA_MASK  (0xFFFFFFFFU)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_SEC_DATA_SEC_DATA_SHIFT (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_SEC_DATA_SEC_DATA_MAX   (0xFFFFFFFFU)

/* CDD_FSI_RX_ECC_LOG */

#define CSL_CDD_FSI_RX_CFG_RX_ECC_LOG_SBE_MASK  (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_LOG_SBE_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_LOG_SBE_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_ECC_LOG_MBE_MASK  (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_LOG_MBE_SHIFT (0x0001U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_LOG_MBE_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_ECC_LOG_RESERVED_1_MASK  (0xFFFCU)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_LOG_RESERVED_1_SHIFT (0x0002U)
#define CSL_CDD_FSI_RX_CFG_RX_ECC_LOG_RESERVED_1_MAX   (0x3FFFU)

/* RESERVED_9 */

/* CDD_FSI_RX_FRAME_TAG_CMP */

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_TAG_REF_MASK  (0x000FU)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_TAG_REF_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_TAG_REF_MAX   (0x000FU)

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_TAG_MASK_MASK  (0x00F0U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_TAG_MASK_SHIFT (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_TAG_MASK_MAX   (0x000FU)

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_CMP_EN_MASK  (0x0100U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_CMP_EN_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_CMP_EN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_BROADCAST_EN_MASK  (0x0200U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_BROADCAST_EN_SHIFT (0x0009U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_BROADCAST_EN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_RESERVED_1_MASK  (0xFC00U)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_RESERVED_1_SHIFT (0x000AU)
#define CSL_CDD_FSI_RX_CFG_RX_FRAME_TAG_CMP_RESERVED_1_MAX   (0x003FU)

/* CDD_FSI_RX_PING_TAG_CMP */

#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_TAG_REF_MASK  (0x000FU)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_TAG_REF_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_TAG_REF_MAX   (0x000FU)

#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_TAG_MASK_MASK  (0x00F0U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_TAG_MASK_SHIFT (0x0004U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_TAG_MASK_MAX   (0x000FU)

#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_CMP_EN_MASK  (0x0100U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_CMP_EN_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_CMP_EN_MAX   (0x0001U)

#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_BROADCAST_EN_MASK  (0x0200U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_BROADCAST_EN_SHIFT (0x0009U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_BROADCAST_EN_MAX   (0x0001U)

