TexasInstruments/mcal_am263x/mcal/FsiRx/V0/Cdd_FsiRx_Reg.h
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_RESERVED_1_MASK  (0xFC00U)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_RESERVED_1_SHIFT (0x000AU)
#define CSL_CDD_FSI_RX_CFG_RX_PING_TAG_CMP_RESERVED_1_MAX   (0x003FU)

/* RESERVED_10 */

/* CDD_FSI_RX_TRIG_CTRL0 */

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL0_TRIG_EN_MASK  (0x00000001U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL0_TRIG_EN_SHIFT (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL0_TRIG_EN_MAX   (0x00000001U)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL0_TRIG_SEL_MASK  (0x0000001EU)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL0_TRIG_SEL_SHIFT (0x00000001U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL0_TRIG_SEL_MAX   (0x0000000FU)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL0_RESERVED_1_MASK  (0x000000E0U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL0_RESERVED_1_SHIFT (0x00000005U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL0_RESERVED_1_MAX   (0x00000007U)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL0_RX_TRIG_DLY_MASK  (0xFFFFFF00U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL0_RX_TRIG_DLY_SHIFT (0x00000008U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL0_RX_TRIG_DLY_MAX   (0x00FFFFFFU)

/* CDD_FSI_RX_TRIG_WIDTH_0 */

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_WIDTH_0_RX_TRIG_WIDTH_MASK  (0x0000FFFFU)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_WIDTH_0_RX_TRIG_WIDTH_SHIFT (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_WIDTH_0_RX_TRIG_WIDTH_MAX   (0x0000FFFFU)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_WIDTH_0_RESERVED_1_MASK  (0xFFFF0000U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_WIDTH_0_RESERVED_1_SHIFT (0x00000010U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_WIDTH_0_RESERVED_1_MAX   (0x0000FFFFU)

/* CDD_FSI_RX_DLYLINE_CTRL */

#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL_RXCLK_DLY_MASK  (0x001FU)
#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL_RXCLK_DLY_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL_RXCLK_DLY_MAX   (0x001FU)

#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL_RXD0_DLY_MASK  (0x03E0U)
#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL_RXD0_DLY_SHIFT (0x0005U)
#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL_RXD0_DLY_MAX   (0x001FU)

#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL_RXD1_DLY_MASK  (0x7C00U)
#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL_RXD1_DLY_SHIFT (0x000AU)
#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL_RXD1_DLY_MAX   (0x001FU)

#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL_RESERVED_1_MASK  (0x8000U)
#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL_RESERVED_1_SHIFT (0x000FU)
#define CSL_CDD_FSI_RX_CFG_RX_DLYLINE_CTRL_RESERVED_1_MAX   (0x0001U)

/* CDD_FSI_RX_TRIG_CTRL1 */

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL1_TRIG_EN_MASK  (0x00000001U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL1_TRIG_EN_SHIFT (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL1_TRIG_EN_MAX   (0x00000001U)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL1_TRIG_SEL_MASK  (0x0000001EU)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL1_TRIG_SEL_SHIFT (0x00000001U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL1_TRIG_SEL_MAX   (0x0000000FU)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL1_RESERVED_1_MASK  (0x000000E0U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL1_RESERVED_1_SHIFT (0x00000005U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL1_RESERVED_1_MAX   (0x00000007U)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL1_RX_TRIG_DLY_MASK  (0xFFFFFF00U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL1_RX_TRIG_DLY_SHIFT (0x00000008U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL1_RX_TRIG_DLY_MAX   (0x00FFFFFFU)

/* CDD_FSI_RX_TRIG_CTRL2 */

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL2_TRIG_EN_MASK  (0x00000001U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL2_TRIG_EN_SHIFT (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL2_TRIG_EN_MAX   (0x00000001U)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL2_TRIG_SEL_MASK  (0x0000001EU)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL2_TRIG_SEL_SHIFT (0x00000001U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL2_TRIG_SEL_MAX   (0x0000000FU)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL2_RESERVED_1_MASK  (0x000000E0U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL2_RESERVED_1_SHIFT (0x00000005U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL2_RESERVED_1_MAX   (0x00000007U)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL2_RX_TRIG_DLY_MASK  (0xFFFFFF00U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL2_RX_TRIG_DLY_SHIFT (0x00000008U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL2_RX_TRIG_DLY_MAX   (0x00FFFFFFU)

/* CDD_FSI_RX_TRIG_CTRL3 */

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL3_TRIG_EN_MASK  (0x00000001U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL3_TRIG_EN_SHIFT (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL3_TRIG_EN_MAX   (0x00000001U)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL3_TRIG_SEL_MASK  (0x0000001EU)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL3_TRIG_SEL_SHIFT (0x00000001U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL3_TRIG_SEL_MAX   (0x0000000FU)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL3_RESERVED_1_MASK  (0x000000E0U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL3_RESERVED_1_SHIFT (0x00000005U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL3_RESERVED_1_MAX   (0x00000007U)

#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL3_RX_TRIG_DLY_MASK  (0xFFFFFF00U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL3_RX_TRIG_DLY_SHIFT (0x00000008U)
#define CSL_CDD_FSI_RX_CFG_RX_TRIG_CTRL3_RX_TRIG_DLY_MAX   (0x00FFFFFFU)

/* RESERVED_11 */

/* CDD_FSI_RX_VIS_1 */

#define CSL_CDD_FSI_RX_CFG_RX_VIS_1_RESERVED_1_MASK  (0x00000007U)
#define CSL_CDD_FSI_RX_CFG_RX_VIS_1_RESERVED_1_SHIFT (0x00000000U)
#define CSL_CDD_FSI_RX_CFG_RX_VIS_1_RESERVED_1_MAX   (0x00000007U)

#define CSL_CDD_FSI_RX_CFG_RX_VIS_1_RX_CORE_STS_MASK  (0x00000008U)
#define CSL_CDD_FSI_RX_CFG_RX_VIS_1_RX_CORE_STS_SHIFT (0x00000003U)
#define CSL_CDD_FSI_RX_CFG_RX_VIS_1_RX_CORE_STS_MAX   (0x00000001U)

#define CSL_CDD_FSI_RX_CFG_RX_VIS_1_RESERVED_2_MASK  (0xFFFFFFF0U)
#define CSL_CDD_FSI_RX_CFG_RX_VIS_1_RESERVED_2_SHIFT (0x00000004U)
#define CSL_CDD_FSI_RX_CFG_RX_VIS_1_RESERVED_2_MAX   (0x0FFFFFFFU)

/* CDD_FSI_RX_USER_DATA */

#define CSL_CDD_FSI_RX_CFG_RX_USER_DATA_USER_REG_MASK  (0x00FFU)
#define CSL_CDD_FSI_RX_CFG_RX_USER_DATA_USER_REG_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_USER_DATA_USER_REG_MAX   (0x00FFU)

#define CSL_CDD_FSI_RX_CFG_RX_USER_DATA_USER_MASK_MASK  (0xFF00U)
#define CSL_CDD_FSI_RX_CFG_RX_USER_DATA_USER_MASK_SHIFT (0x0008U)
#define CSL_CDD_FSI_RX_CFG_RX_USER_DATA_USER_MASK_MAX   (0x00FFU)

/* RESERVED_12 */

/* RX_BUF_BASE */

#define CSL_CDD_FSI_RX_CFG_RX_BUF_BASE_BASE_ADDRESS_MASK  (0xFFFFU)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_BASE_BASE_ADDRESS_SHIFT (0x0000U)
#define CSL_CDD_FSI_RX_CFG_RX_BUF_BASE_BASE_ADDRESS_MAX   (0xFFFFU)

#ifdef _cplusplus
}
#endif
#endif /* #ifndef CDD_FSI_RX_REG_H_ */
